Test results for DNS ingress policy for PSC endpoint
The DNS server policy is separate from PSC creation.
The IP for the policy is created on the fly

```
Step #3 - "tf plan": Terraform will perform the following actions:
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.private_service_connect.google_compute_global_forwarding_rule.forwarding_rule_private_service_connect will be created
Step #3 - "tf plan":   + resource "google_compute_global_forwarding_rule" "forwarding_rule_private_service_connect" {
Step #3 - "tf plan":       + base_forwarding_rule  = (known after apply)
Step #3 - "tf plan":       + id                    = (known after apply)
Step #3 - "tf plan":       + ip_address            = "projects/tzpe-tlz-tlzprod-host4/global/addresses/global-psconnect-ip"
Step #3 - "tf plan":       + ip_protocol           = (known after apply)
Step #3 - "tf plan":       + label_fingerprint     = (known after apply)
Step #3 - "tf plan":       + name                  = "pscincoming"
Step #3 - "tf plan":       + network               = "projects/tzpe-tlz-tlzprod-host4/global/networks/tzpecnr-tlzprod-svpc-vpc"
Step #3 - "tf plan":       + project               = "tzpe-tlz-tlzprod-host4"
Step #3 - "tf plan":       + psc_connection_id     = (known after apply)
Step #3 - "tf plan":       + psc_connection_status = (known after apply)
Step #3 - "tf plan":       + self_link             = (known after apply)
Step #3 - "tf plan":       + subnetwork            = (known after apply)
Step #3 - "tf plan":       + target                = "all-apis"
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.private_service_connect.google_dns_policy.default_policy will be created
Step #3 - "tf plan":   + resource "google_dns_policy" "default_policy" {
Step #3 - "tf plan":       + description               = "Managed by Terraform"
Step #3 - "tf plan":       + enable_inbound_forwarding = true
Step #3 - "tf plan":       + enable_logging            = false
Step #3 - "tf plan":       + id                        = (known after apply)
Step #3 - "tf plan":       + name                      = "psc-ingress-policy"
Step #3 - "tf plan":       + project                   = "tzpe-tlz-tlzprod-host4"
Step #3 - "tf plan": 
Step #3 - "tf plan":       + networks {
Step #3 - "tf plan":           + network_url = "projects/tzpe-tlz-tlzprod-host4/global/networks/tzpecnr-tlzprod-svpc-vpc"
Step #3 - "tf plan":         }
Step #3 - "tf plan":     }
```



DNS server policy
<img width="1105" alt="Screenshot 2023-09-06 at 10 22 54" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/4e22aa33-acb8-40e2-a86e-bacc461566c6">

Details on IP association
<img width="1034" alt="Screenshot 2023-09-06 at 10 23 11" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/9a165290-3177-48ac-8731-5abfcfb847b4">

Reserved internal IP
<img width="1390" alt="Screenshot 2023-09-06 at 10 23 33" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/a8ba2d40-31d3-4cbd-9ce0-f26d92074176">